{"pageProps":{"postData":{"id":"preparing_cloud_images_with_libvirt","contentHtml":"<p>This article will show you how to use libvirt to create base images that\ncan be uploaded to OpenStack.</p>\n<h1>Why would you want to do this?</h1>\n<p>Linux distributions like Fedora and Ubuntu already ship \"cloud\" images\nand most providers also have their own custom images for you to use, but\nI find it much more comforting to have full control of the software that\nis installed and I like the ability to easily apply new security patches\nto base images.</p>\n<p>I wouldn't use images to replace config management (CM) with something\nlike <a href=\"http://www.saltstack.com/\">Salt</a> or\n<a href=\"http://www.ansible.com/\">Ansible</a> but they are nice to give sane system\ndefaults in things like <code>grub.conf</code>, <code>sysctl.conf</code>, and shipping a Chef\nor Salt agent so that your CM engine can communicate with your server\nright away.</p>\n<h1>Setting up your environment</h1>\n<p>The first thing you need to do is get a minimal install disk for the\nLinux distribution you want to use. I prefer using Fedora netinst disks\nbut another popular option is Ubuntu Server.</p>\n<p>To get the latest Fedora here, you can choose \"netinst\" under Direct\nDownloads: <a href=\"http://fedoraproject.org/en/get-fedora-all\">http://fedoraproject.org/en/get-fedora-all</a></p>\n<p>To get the latest Ubuntu you can go here:\n<a href=\"http://www.ubuntu.com/download/server\">http://www.ubuntu.com/download/server</a></p>\n<p>Once you have acquired your distribution of choice you just need to\nverify that you have <code>virt-install</code> and <code>virt-viewer</code> installed:</p>\n<p>Fedora:</p>\n<pre><code>yum install virt-install virt-viewer</code></pre>\n<p>Ubuntu:</p>\n<pre><code>apt-get install virtinst virt-viewer</code></pre>\n<p>If you prefer a graphical user interface, you may use <code>virt-manager</code>\ninstead, but I try to keep everything in the CLI; that way it can be\nrepeated easily.</p>\n<h1>Preparing your disk</h1>\n<p>Now that you have a base ISO and the tools necessary, let's get started\nby creating a disk to install the virtual server into. Resizing an image\nisn't an impossible task but it is much easier to choose a reasonably\nsized disk for the purpose it will be used for.</p>\n<p>I primarily use 8 GB disks -- that way we can fit all the system\ncomponents required as well as our own web applications. Any large files\nshould be placed in a SAN or something like Dreamhost's dreamobjects.</p>\n<p>The other big decision you must make upfront is what disk format you\nwant to use -- the trade-off is disk space vs performance. The two\nprimary formats are qcow2 (QEMU Copy on Write) and Raw. qcow2 is great\nif you have limited disk space and don't want to allocate the full 8 GB\nup front. Raw is preferred if you want the best performance.</p>\n<p>If you choose qcow2, you'll also need to make sure you have <code>qemu-img</code>:</p>\n<p>Fedora:</p>\n<pre><code>yum install qemu-img</code></pre>\n<p>Ubuntu:</p>\n<pre><code>apt-get install qemu-utils</code></pre>\n<p>Create a raw disk:</p>\n<pre><code>fallocate -l 8192M server.img</code></pre>\n<p>Create a qcow2 disk:</p>\n<pre><code>qemu-img create -f qcow2 server.qcow2 8G</code></pre>\n<h1>Installing your distribution onto the disk</h1>\n<p>We will use the <code>virt-install</code> command to get the distribution installed\nonto the disk image.</p>\n<p>To install Fedora on a qcow2 disk image:</p>\n<pre><code>virt-install --name base_server --ram 1024 --cdrom=./Fedora-20-x86_64-netinst.iso \\\n--disk path=./server.qcow2,format=qcow2</code></pre>\n<p>To install Ubuntu Server on a raw disk image:</p>\n<pre><code>virt-install --name base_server --ram 1024 --cdrom=./ubuntu-12.04.4-server-amd64.iso \\\n--disk path=./server.img,format=raw</code></pre>\n<p>You should follow the standard install steps that you normally would\nwhen setting up your distribution. But here are some tips for each:</p>\n<p>Fedora:</p>\n<ul>\n<li>Choose minimal install -- by default it selects \"GNOME\".</li>\n</ul>\n<p>Ubuntu:</p>\n<ul>\n<li>\n<p>Be sure to select OpenSSH server -- it won't install it by\ndefault.</p>\n</li>\n<li>\n<p>On Ubuntu 12.04, there is a bug that makes it hang after running\n<code>fsck</code>. You will need to edit grub to get it to boot, hit _<a href=\"\">e</a> at\nthe boot prompt and add \"nomodeset\" on the linux line. You will\nknow that you need to do this if your boot hangs on fsck:</p>\n<pre><code>fsck from util-linux 2.20.1\n/dev/mapper/ubuntu--vg-root: clean, 57106/441504 files, 286779/1764352 blocks\n/dev/sda1: clean, 230/62248 files, 39833/248832 blocks</code></pre>\n</li>\n</ul>\n<h1>Preparing image for openstack</h1>\n<p>To prepare a virtual machine for the cloud, you will need to install the\n<code>cloud-init</code> package, which allows the cloud providers to inject certain\nsystem settings when creating servers based on the image. These are\nthings like hostname and ssh keys.</p>\n<p>On Fedora:</p>\n<pre><code>yum install cloud-init</code></pre>\n<p>On Ubuntu:</p>\n<pre><code>apt-get install cloud-init</code></pre>\n<p>Then you need to just configure <code>cloud-init</code> by editing\n<code>/etc/cloud/cloud.cfg</code> and update the <code>datasources_list</code> section to\ninclude EC2. OpenStack uses EC2 metadata for <code>cloud-init</code>.</p>\n<p>You should also verify the user setting in this same config and define\nthe user you plan to use, it will be where the <code>authorized_keys</code> file is\nsetup for when the cloud provider injects your SSH key into the server.</p>\n<p><code>cloud-init</code> will not create the user for you, it will just assign the\nSSH keypair and reset the password. So make sure the user defined in\n<code>cloud.cfg</code> is also created on the system.</p>\n<p>Once you have your <code>cloud-init</code> settings the way you want them, just\nshutdown and run the <code>virt-sysprep</code> command.</p>\n<p>On the guest machine:</p>\n<pre><code>shutdown -h now</code></pre>\n<p>On the host machine:</p>\n<pre><code>virt-sysprep -d base_server</code></pre>\n<h1>Uploading your image to OpenStack</h1>\n<p>Using the glance API it is very straightforward to upload the image to\nOpenStack. Just run the following command:</p>\n<pre><code>glance image-create --name base_server --disk-format=qcow2 \\\n--container-format=bare --is-public=True --file server.qcow2 --progress</code></pre>\n<p>Once the image upload completes you will be able to use it immediately\nwithin nova. You can reference it by name or by the id from [glance\nimage-list]{.title-ref}.</p>\n<p>To create your first instance from the image:</p>\n<pre><code>nova boot --flavor m1.tiny --image base_server --key-name devops \\\n--security-groups free_for_all test_server</code></pre>\n<p>Obviously the security groups, key name, and flavors are based on your\ninstallation of OpenStack but can all easily be queried from the nova\nAPI:</p>\n<pre><code>nova flavor-list\nnova secgroup-list\nnova keypair-list</code></pre>\n<p>And you are done! You'll be able to re-use your new image as a base for\nall new instances you spin up in openstack!</p>\n","category":"devops\n","date":"2014-08-02T20:00:00-04:00","tags":"linux, openstack, libvirt\n","title":"Preparing custom images for OpenStack"}},"__N_SSG":true}